Revit 2027 API
Entity Constructor
 The default-constructed Entity is invalid.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Entity()
Public Sub New
public:
Entity()
new : unit -> Entity
Remarks
 Invalid entities may be used as token values. E.g., setting an invalid subentity is equivalent to deleting the stored one.
See Also
Reference
Entity Class
Entity Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace